{"head":{"title":"Meetup","subtitle":"HTML5 WebApp","date":"2013-04","layout":"Post","size":"small","image":"meetup.jpg","description":"Meetup App In the past ten years we have seen technology bring people together in a virtual space, Meetup attempts to do the opposite and…"},"body":"<h1 id=\"meetup-app\"><a href=\"#meetup-app\" class=\"phenomic-HeadingAnchor\">#</a>Meetup App</h1>\n<p>In the past ten years we have seen technology bring people together in a virtual space, Meetup attempts to do the opposite and bring people together in real life. You can think of it like video game matchmaking, but in real life. For instance, if you are new to a city or just want to meet someone new, and decide that you would like to go get dinner within the next 3 hours, just log on to the website, specify what you would like to do and you will be matched with someone looking to do the same.</p>\n<div class=\"spacer\" />\n<h2 id=\"usage\"><a href=\"#usage\" class=\"phenomic-HeadingAnchor\">#</a>Usage</h2>\n<p><img src=\"/assets/meetup01.png\" alt=\"Meetup Screen\">\nUsers can sign up and upload their own images.</p>\n<p><img src=\"/assets/meetup02.gif\" alt=\"Meetup Screen\">\nThe site will automatically scale the image and mask it into a circle.</p>\n<p><img src=\"/assets/meetup03.png\" alt=\"Meetup Screen\">\nNext, the user will be asked to specify their location. The HTML5 geolocation API can be used to locate users without having them explicitly type in their address.</p>\n<p><img src=\"/assets/meetup04.png\" alt=\"Meetup Screen\">\nThen, the user can decide what activity and what time frame they would like the do said activity in.</p>\n<p><img src=\"/assets/meetup05.gif\" alt=\"Meetup Screen\">\nFinally, based on the activity, time, and location (the location not yet implemented), the user will be matched up into a chatroom with other users who can then determine a place to meet.</p>\n<div class=\"spacer\" />\n<h2 id=\"tech-stack\"><a href=\"#tech-stack\" class=\"phenomic-HeadingAnchor\">#</a>Tech Stack</h2>\n<p>Meetup app is built on top of the MEAN stack with Socket.IO added for chat and the realtime matchmaking.</p>\n","__filename":"work/meetup.md","__url":"/work/meetup/","__resourceUrl":"/work/meetup/index.html","__dataUrl":"/work/meetup/index.html.c427e4777e0350e722995314722c56cd.json"}