{"head":{"title":"Project Alpha","subtitle":"Unity3d Game","date":"2013-04","layout":"Post","size":"small","image":"projectalpha.jpg","description":"Project Alpha Project Alpha is an RTS game in that was in its early stages of development using the Unity3d game engine. We have ceased…"},"body":"<h1 id=\"project-alpha\"><a href=\"#project-alpha\" class=\"phenomic-HeadingAnchor\">#</a>Project Alpha</h1>\n<p>Project Alpha is an RTS game in that was in its early stages of development using the Unity3d game engine. We have ceased production on the project.</p>\n<p><a href=\"/assets/projectalpha/mockup01.png\"><img src=\"/assets/projectalpha/mockup01sm.png\"></img></a></p>\n<div class=\"spacer\" />\n<h2 id=\"progress\"><a href=\"#progress\" class=\"phenomic-HeadingAnchor\">#</a>Progress</h2>\n<p>Currently a lot of the basic groundwork has been completed. Our own version of lockstep networking has also been implemented, so the game should be able to handle a large number of units. Deterministic flocking and collisions are still lacking, however (as is evident in the demo video).</p>\n<p>We have almost completely finished the creation of one of our creeps, and a hero unit is coming along quickly. Once they are completely finished and we have a consistent pipeline for their creation, the rest should be produced more efficiently.</p>\n<p>Below is an interactive turntable of the first creep we have created: the Gorilla Yeti. Click and drag on top of the image to rotate.</p>\n<iframe src=\"http://users.design.ucla.edu/~lual3x/stuff/YetiVR/YetiVR.html\" width=\"800\" height=\"450\" frameborder=\"0\"></iframe>\n<p>The model is very light, consisting of only around 300 triangles. Most of the detail was added on via a very high-poly sculpt in Z-Brush which was then baked onto the original model (note that in the above turntable, only about half of the model has the detailed texture applied so far).</p>\n<p>Inside the game, the normal map is applied from the high poly model, so the character can be lit dynamically. There\nis also a shader applied to it that simulates rim lighting.\n<img src=\"/assets/projectalpha/rimlight.jpg\" alt=\"rimlight\"></p>\n<p>The following video is an early recording. Several additional features have since been added afterwards.</p>\n<iframe src=\"http://player.vimeo.com/video/65619032?title=0&amp;byline=0&amp;portrait=0&amp;color=ffffff\" width=\"800\" height=\"450\" frameborder=\"0\" webkitAllowFullScreen=\"true\" mozallowfullscreen=\"true\" allowFullScreen=\"true\"></iframe>\n<div class=\"spacer\" />\n<h2 id=\"concept\"><a href=\"#concept\" class=\"phenomic-HeadingAnchor\">#</a>Concept</h2>\n<p>The concept behind Project Alpha is to create a solid RTS gaming experience while adding on our own unique, creative twist to the genre. So far, our idea involves adding elements from other genres such as central hero units that can gain new abilities and level up from MOBA games and being able to assimilate attributes from other characters like in Spore.</p>\n<p>Our art style will be decidedly whimsical as shown in the concept art below:\n<img src=\"/assets/projectalpha/yetis.jpg\" alt=\"yetis\">\n<img src=\"/assets/projectalpha/heroes.jpg\" alt=\"heroes\">\n<img src=\"/assets/projectalpha/robot.jpg\" alt=\"robot\"></p>\n","__filename":"work/projectalpha.md","__url":"/work/projectalpha/","__resourceUrl":"/work/projectalpha/index.html","__dataUrl":"/work/projectalpha/index.html.f537ff9f51ddc643cb3a95e7daa4d283.json"}