{"head":{"title":"Hyperion.ai","subtitle":"Startup","date":"2016-04","layout":"Post","size":"large","image":"hyperionai.jpg","description":"Hyperion.ai Hyperion.ai is the product of a startup I am currently the co-founder and CEO of. It is a custom multivitamin that improves…"},"body":"<div style=\"margin-top: 170px\" />\n<h1 id=\"hyperionai\"><a href=\"#hyperionai\" class=\"phenomic-HeadingAnchor\">#</a>Hyperion.ai</h1>\n<p><img style=\"margin: auto; text-align: center; width: 150px; position: absolute; top: -20px; left: 0; right: 0\" src=\"/assets/hyperion/hyperionai.gif\" /></p>\n<p>Hyperion.ai is the product of a startup I am currently the co-founder and CEO of. It\nis a custom multivitamin that improves itself over time by using artificial\nintelligence to continuously monitor and analyze a user's health data. This\nwriteup will be focused primarily on the business, tech aspects, and other\nbehind the scenes aspects of Hyperion.ai. For more information about the product\nitself, check out: <a href=\"http://hyperion.ai\">http://hyperion.ai</a></p>\n<iframe src=\"https://player.vimeo.com/video/180539408?color=ffffff&title=0&byline=0&portrait=0\" width=\"800\" height=\"450\" frameborder=\"0\" webkitallowfullscreen=\"true\" mozallowfullscreen=\"true\" allowfullscreen=\"true\"></iframe>\n<div class=\"spacer\" />\n<h2 id=\"overview\"><a href=\"#overview\" class=\"phenomic-HeadingAnchor\">#</a>Overview</h2>\n<p>People come in all different shapes and sizes. So, it’s no surprise that we all have unique nutritional needs. The nutritional supplement industry has capitalized on this problem, but we feel that current solutions leave a lot to be desired. Today, when consumers shop for vitamins-whether from a local drugstore or online-they are bombarded with tons of options. How are they supposed to know which product meets their needs? And perhaps more importantly, how are they supposed to know if said product provides a tangible improvement to their quality of life? That’s where we come in.</p>\n<p>Hyperion AI provides a completely free app that collects a user’s health data. The app allows users to track any metric they’d like. Additionally, users can connect fitness integrations such as HealthKit and Fitbit. We then visualize these metrics so that the user can see their progress over time. On top of that, we also normalize the data, allowing users to compare different metric against one another. For example, a user might wonder if their overall energy levels correlate with the amount of water they drink. With Hyperion AI, it’s only a few taps away. Finally, Hyperion AI will use artificial intelligence to continuously process the user’s health data, allowing us to find potentially significant correlations between tracked metrics. If the user is subscribed to one of our monthly supplement plans, the AI will also construct and continuously refine a unique, custom supplement tailored for each user, which will ship on a monthly basis.</p>\n<p>We believe that by eliminating the financial barrier to entry, our free app gives us a huge edge against our competitors, building a relationship of trust with our users before they give us a dime.</p>\n<div class=\"spacer\" />\n<h2 id=\"progress\"><a href=\"#progress\" class=\"phenomic-HeadingAnchor\">#</a>Progress</h2>\n<p>Hyperion.ai consists of two main components, the App and the Physical supplement itself.</p>\n<h3 id=\"app\"><a href=\"#app\" class=\"phenomic-HeadingAnchor\">#</a>App</h3>\n<p>We currently have a functioning prototype of the app on TestFlight. We are\nplanning to have a beta out on the iOS app store within the next few months.\nWhile the app is currently not in app stores yet, I have\na recording here of our prototype in action:</p>\n<iframe width=\"800\" height=\"450\" src=\"https://www.youtube.com/embed/kV4bO9HSraI\" frameborder=\"0\" allowfullscreen=\"true\"></iframe>\n<p>And if you are interested in trying out the app yourself (iOS only at the moment—support for other platforms planned),\nplease don't hesitate to reach out!</p>\n<h3 id=\"physical-supplement\"><a href=\"#physical-supplement\" class=\"phenomic-HeadingAnchor\">#</a>Physical Supplement</h3>\n<p>We also have a rough prototype of the physical supplement itself. While we are currently capable of creating the pills, we will\nneed a cGMP compliant facility to produce them before we can legally distribute them per FDA regulations. Currently, the supplements\nare being hand produced, but we hope to automate as much of this process as possible in the future.</p>\n<div class=\"spacer\" />\n<h2 id=\"tech-stack\"><a href=\"#tech-stack\" class=\"phenomic-HeadingAnchor\">#</a>Tech Stack</h2>\n<h3 id=\"website\"><a href=\"#website\" class=\"phenomic-HeadingAnchor\">#</a>Website</h3>\n<h3 id=\"app-1\"><a href=\"#app-1\" class=\"phenomic-HeadingAnchor\">#</a>App</h3>\n<h3 id=\"service\"><a href=\"#service\" class=\"phenomic-HeadingAnchor\">#</a>Service</h3>\n<div class=\"spacer\" />\n<h2 id=\"branding\"><a href=\"#branding\" class=\"phenomic-HeadingAnchor\">#</a>Branding</h2>\n<h3 id=\"logo\"><a href=\"#logo\" class=\"phenomic-HeadingAnchor\">#</a>Logo</h3>\n<h3 id=\"video\"><a href=\"#video\" class=\"phenomic-HeadingAnchor\">#</a>video</h3>\n<h3 id=\"site\"><a href=\"#site\" class=\"phenomic-HeadingAnchor\">#</a>Site</h3>\n<div class=\"spacer\" />\n<h2 id=\"team\"><a href=\"#team\" class=\"phenomic-HeadingAnchor\">#</a>Team</h2>\n<div class=\"spacer\" />\n","__filename":"work/hyperionai.md","__url":"/work/hyperionai/","__resourceUrl":"/work/hyperionai/index.html","__dataUrl":"/work/hyperionai/index.html.cdd1b9752fefc3b99f5fac98fca995a9.json"}