{"head":{"title":"Hyperion.ai","subtitle":"App","date":"2016-04","layout":"Post","size":"large","image":"hyperionai.jpg","description":"Hyperion.ai Hyperion.ai allows users to track any metric that they like over time. Nowadays, there are a ton of new health fads, diets,…"},"body":"<div style=\"margin-top: 170px\" />\n<h1 id=\"hyperionai\"><a href=\"#hyperionai\" class=\"phenomic-HeadingAnchor\">#</a>Hyperion.ai</h1>\n<p><img style=\"margin: auto; text-align: center; width: 150px; position: absolute; top: -20px; left: 0; right: 0\" src=\"/assets/hyperion/hyperionai.gif\" /></p>\n<p>Hyperion.ai allows users to track any metric that they like over time. Nowadays, there are a ton of\nnew health fads, diets, workout routines, etc. Often times these fads are not supported by any\nsignificant evidence. Additionally, they often rely on solely on the experience of the individual\nwho happens to be sharing the information. However, people are all different. Something that works\nfor one person does not necessarily work for someone else. By using Hyperion.ai, users can quickly\nnarrow down on what works and what doesn’t. Hyperion.ai will graph the users' metrics onto custom\ncharts that they can define. Additionally, because it is sometimes difficult to determine\ncorrelation between several metrics, Hyperion.AI uses a deep neural network to help find these\ncorrelations and present them to the user.</p>\n<p>You can check out a demo and writeup of the deep network here: <a href=\"http://alx.lu/ml\">http://alx.lu/ml</a></p>\n<p>And the marketing page can be found here (note: demo vid on site is outdated): <a href=\"http://www.hyperion.ai\">http://www.hyperion.ai</a></p>\n<p>I created Hyperion.AI using React, React Native, Redux, and Redux – saga. The backend is written\nusing node JS, Redis, and PostgreSQL. It is deployed to Heroku along with a custom clock process\nthat will send unprocessed data to the deep neural network that I deployed to AWS.</p>\n<p>Hyperion.ai was initially part of a startup that I had co-founded full time. We were initially\nplanning to ship a supplement that would use our deep network to continuously tweak the user's\nsupplement formulation based on their metrics.</p>\n<p>You can read the original write up for the startup here: <a href=\"http://alx.lu/work/hyperionai-old\">http://alx.lu/work/hyperionai-old</a></p>\n<p>While it was a great learning experience, we realized that it would be incredibly difficult to prove\nthe efficacy of the physical product before launch. We did not have the resources to run any sort of\nclinical trials on the product and therefore we felt uncomfortable releasing the supplement to the\npublic. </p>\n<p>I ended up shipping the app as a standalone product. This went well for a few months and the product\nexperienced some solid growth. At that point, there was still no solid business plan. Since I\nwas working on the startup by myself at this point, most of my time was spent trying to stabilize\nthe service to accomodate the influx of new users. Ultimately, the service had to be shut down\nbecause it became untenable to justify the cost of maintaining the service without a concrete plan\nfor generating revenue.</p>\n<p>I believe there is still potential in this concept. It's something I will definitely consider\nrevisiting in the future.</p>\n<div class=\"spacer\" />\n","__filename":"work/hyperionai.md","__url":"/work/hyperionai/","__resourceUrl":"/work/hyperionai/index.html","__dataUrl":"/work/hyperionai/index.html.26546a2b23a8636539187d991ca34d05.json"}