{"head":{"title":"SlideApp","subtitle":"HTML5 WebApp","date":"2014-09","layout":"Post","size":"small","image":"slideapp.jpg","description":"SlideApp SlideApp is a webapp I started as a side-project over the 2013 winter break. I wanted to both try and create something that could…"},"body":"<h1 id=\"slideapp\"><a href=\"#slideapp\" class=\"phenomic-HeadingAnchor\">#</a>SlideApp</h1>\n<video id=\"vid\" autoplay=\"true\" loop=\"true\" width=\"800\" height=\"auto\" poster=\"/assets/slideapp-placeholder.jpg\">\n  <source src=\"/assets/slideapp.webm\"></source>\n  <source src=\"/assets/slideapp.mp4\"></source>\n  <img src=\"placeholder.jpg\" title=\"Your browser does not support the video tag\">\n</video>\n<div class=\"spacer\" />\n<p>SlideApp is a webapp I started as a side-project over the 2013 winter break. I wanted to both try and create something that could potentially be used and to become more familiar with the full web stack. The project allows a user to create and then present slideshows using a remote without having to install any software of perform any preliminary setup.</p>\n<p>All the user has to do is log into as many presentation machines as he would like, then log into his own phone (they don't need to be on the same network), select his presentation, and hit launch. From there, all the other machines will automatically load thhe presentation and able to be controlled from the remote.</p>\n<p>The hosting for this project has since expired, I can re-deploy it to my VPS upon request.</p>\n<div class=\"spacer\" />\n<h2 id=\"technology\"><a href=\"#technology\" class=\"phenomic-HeadingAnchor\">#</a>Technology</h2>\n<p>SlideApp uses MongoDB for its database, Express.js and Node.js for the backend, and Angular.js for the frontend. The presentations use Impress.js (support for other slidesow libraries will be added soon) as well as Socket.io.</p>\n<div class=\"spacer\" />\n<h2 id=\"usage\"><a href=\"#usage\" class=\"phenomic-HeadingAnchor\">#</a>Usage</h2>\n<p>Controlling slideshows should be fairly intuitive, but creating slides is a bit less clear. I will probably build out a better canvas-based way of creating slides that should be more intuitive. In the meantime, here are instructions on how to use the interface for creating slides.</p></p>\n<p><img src=\"/assets/slideapp01.png\" alt=\"SlideApp Screen\"></p>\n<p>To create a new presentation, just log in and hit the \"New Presentation\" button.</p>\n<p><img src=\"/assets/slideapp02.gif\" alt=\"SlideApp Screen\"></p>\n<p>You will then be presented with the slide creation interface. While there, simply fill out the forms for Title, Content, and Notes and see a preview of how it will look on the right. After you have added the content, just hit the Add button. You will notice the button will change to have an additional Save button. If the Save button is not present, that means there are no changes to save.</p>\n<p><img src=\"/assets/slideapp03.gif\" alt=\"SlideApp Screen\"></p>\n<p>Users can edit previous slides by clicking on its thumbnail. You will notice the button on the bottom changes once again. To save your changes to the slide, just hit Edit, otherwise hit cancel.</p>\n<p><img src=\"/assets/slideapp04.gif\" alt=\"SlideApp Screen\"></p>\n<p>After editing slides, you can just go back to simply adding slides to the end (ability to insert slides in between will be added later).</p>\n<p></p>\n<div style = \"padding-top: 30px; padding-bottom: 30px\"></div>\n<h1>More Info</h1>\n<p>Will be adding more info here shortly as well as possibly some wireframes if I am able to get access to a scanner.</p>\n","__filename":"work/slideapp.md","__url":"/work/slideapp/","__resourceUrl":"/work/slideapp/index.html","__dataUrl":"/work/slideapp/index.html.5dcb607dc8a5931f1439452679eedf4a.json"}