{"head":{"title":"Hyperion.ai Old","subtitle":"Startup","date":"2016-04","layout":"Post","size":"hidden","image":"hyperionai.jpg","description":"Hyperion.ai Hyperion.ai is the product of a startup I am currently the co-founder and CEO of. It is a custom multivitamin that improves…"},"body":"<div style=\"margin-top: 170px\" />\n<h1 id=\"hyperionai\"><a href=\"#hyperionai\" class=\"phenomic-HeadingAnchor\">#</a>Hyperion.ai</h1>\n<p><img style=\"margin: auto; text-align: center; width: 150px; position: absolute; top: -20px; left: 0; right: 0\" src=\"/assets/hyperion/hyperionai.gif\" /></p>\n<p>Hyperion.ai is the product of a startup I am currently the co-founder and CEO\nof. It is a custom multivitamin that improves itself over time by using\nartificial intelligence to continuously monitor and analyze a user's health\ndata. This writeup will be focused primarily on the business, technology, and\nother behind the scenes aspects of Hyperion.ai. For more information about the\nproduct itself, check out: <a href=\"http://hyperion.ai\">http://hyperion.ai</a></p>\n<iframe src=\"https://player.vimeo.com/video/180539408?color=ffffff&title=0&byline=0&portrait=0\"\nwidth=\"800\" height=\"450\" frameborder=\"0\" webkitallowfullscreen=\"true\"\nmozallowfullscreen=\"true\" allowfullscreen=\"true\"></iframe>\n<div class=\"spacer\" />\n<h2 id=\"overview\"><a href=\"#overview\" class=\"phenomic-HeadingAnchor\">#</a>Overview</h2>\n<p>People come in all different shapes and sizes. So, it’s no surprise that we all have unique nutritional needs. The nutritional supplement industry has capitalized on this problem, but we feel that current solutions leave a lot to be desired. Today, when consumers shop for vitamins-whether from a local drugstore or online-they are bombarded with tons of options. How are they supposed to know which product meets their needs? And perhaps more importantly, how are they supposed to know if said product provides a tangible improvement to their quality of life? That’s where we come in.</p>\n<p>Hyperion AI provides a completely free app that collects a user’s health data. The app allows users to track any metric they’d like. Additionally, users can connect fitness integrations such as HealthKit and Fitbit. We then visualize these metrics so that the user can see their progress over time. On top of that, we also normalize the data, allowing users to compare different metric against one another. For example, a user might wonder if their overall energy levels correlate with the amount of water they drink. With Hyperion AI, it’s only a few taps away. Finally, Hyperion AI will use artificial intelligence to continuously process the user’s health data, allowing us to find potentially significant correlations between tracked metrics. If the user is subscribed to one of our monthly supplement plans, the AI will also construct and continuously refine a unique, custom supplement tailored for each user, which will ship on a monthly basis.</p>\n<p>We believe that by eliminating the financial barrier to entry, our free app gives us a huge edge against our competitors, building a relationship of trust with our users before they give us a dime.</p>\n<div class=\"spacer\" />\n<h2 id=\"progress\"><a href=\"#progress\" class=\"phenomic-HeadingAnchor\">#</a>Progress</h2>\n<h3 id=\"app\"><a href=\"#app\" class=\"phenomic-HeadingAnchor\">#</a>App</h3>\n<p>We currently have a functioning prototype of the app on TestFlight. We are\nplanning to have a beta out on the iOS app store within the next few months.\nWhile the app is currently not in app stores yet, I have\na recording here of our prototype in action:</p>\n<iframe width=\"800\" height=\"450\" src=\"https://www.youtube.com/embed/kV4bO9HSraI\" frameborder=\"0\" allowfullscreen=\"true\"></iframe>\n<p>And if you are interested in trying out the app yourself (iOS only at the moment—support for other platforms planned),\nplease don't hesitate to reach out!</p>\n<h3 id=\"physical-supplement\"><a href=\"#physical-supplement\" class=\"phenomic-HeadingAnchor\">#</a>Physical Supplement</h3>\n<p>We also have a rough prototype of the physical supplement itself. While we are currently capable of creating the pills, we will\nneed a cGMP compliant facility to produce them before we can legally distribute them per FDA regulations. Currently, the supplements\nare being hand produced, but we hope to automate as much of this process as possible in the future.</p>\n<p><img src=\"/assets/hyperion/pills.jpg\" alt=\"Prototype\"></p>\n<div class=\"spacer\" />\n<h2 id=\"tech-stack\"><a href=\"#tech-stack\" class=\"phenomic-HeadingAnchor\">#</a>Tech Stack</h2>\n<h3 id=\"app--web-ui\"><a href=\"#app--web-ui\" class=\"phenomic-HeadingAnchor\">#</a>App &#x26; Web UI</h3>\n<p>Hyperion.ai is a React Native App. And the Web UI is written\nusing React. For both platforms we use Redux to manage state and Redux-Saga\nfor side effects (e.g. API calls). This allows us to share a lot of the\nbusiness logic despite the differences between React Native and React (web)\ncomponents. Additionally, we also use the iOS WebView element to display\nseveral views in our app. This allows us to develop the mobile site and iOS\napp simultaneously while giving us the option to implement the view\nnatively. So far, despite HTML5-based apps reputation for being less\nperformant than native, the difference in performance for our app is\nimperceptible. I believe this is due to a combination of factors:</p>\n<ul>\n<li>Improved browser rendering engines</li>\n<li>The nature of our app (e.g. we don't need to perform any expensive animations)</li>\n<li>Improved hardware</li>\n</ul>\n<p>Currently, I only use React Native views primarily to provide a more native-like experience. For instance,\nthe ability to swipe to go back to a previous page is something easily done using React Native, but is difficult\n(and likely less performant using HTML5).</p>\n<div class=\"spacer\" />\n<h3 id=\"service\"><a href=\"#service\" class=\"phenomic-HeadingAnchor\">#</a>Service</h3>\n<p>The Hyperion.ai backend is written using Node.js and the database is hosted using\nPostgreSQL. For the backend, I decided to leverage several services to help speed up\ndevelopment and potentially reduce headaches down the line—particularly regarding\nsecurity. We are using Heroku to host the service.</p>\n<p>For a writeup and demo on the deep neural network, please visit: <a href=\"http://alx.lu/ml\">http://alx.lu/ml</a></p>\n<div class=\"spacer\" />\n<h3 id=\"tooling--deployment\"><a href=\"#tooling--deployment\" class=\"phenomic-HeadingAnchor\">#</a>Tooling &#x26; Deployment</h3>\n<p>I set up Jenkins to handle running out automated tests and deployment. Whenever a change is made to the Deployment\nbranch in either of the projects, Jenkins will run all our automated tests and if they pass, it will deploy them to\nproduction (AWS for the frontend, Heroku for the backend).</p>\n<div class=\"spacer\" />\n<h2 id=\"branding\"><a href=\"#branding\" class=\"phenomic-HeadingAnchor\">#</a>Branding</h2>\n<h3 id=\"coming-soon\"><a href=\"#coming-soon\" class=\"phenomic-HeadingAnchor\">#</a>Coming Soon!</h3>\n<p>Since Hyperion Industries is completely bootstrapped, I had to create our video\non a shoestring budget. That meant that the motion graphics, video editing, and\noverall branding had to be done by myself. If you'd like to learn more, feel\nfree to either <a href=\"/about\">contact me directly</a> or check back on this section\nlater!</p>\n<div class=\"spacer\" />\n<h2 id=\"team\"><a href=\"#team\" class=\"phenomic-HeadingAnchor\">#</a>Team</h2>\n<h3 id=\"alex-me\"><a href=\"#alex-me\" class=\"phenomic-HeadingAnchor\">#</a>Alex (Me)</h3>\n<p>As the CEO of <a href=\"https://hyperion.industries\">Hyperion Industries</a>, my\nresponsibilities include developing, deploying, and designing the app and machine learning service,\ncreating the marketing pages/videos/content/branding/designs/etc., setting up the company, and\ndetermining our overall business plan.</p>\n<h3 id=\"dylan\"><a href=\"#dylan\" class=\"phenomic-HeadingAnchor\">#</a>Dylan</h3>\n<p>Dylan is our Chief Scientist. He graduated from UCLA with a degree in\nBiochemistry and has worked at the International Stem Cell Corporation. Dylan\nwas instrumental in designing and creating the physical prototype of our\nnutritional supplement.</p>\n<h3 id=\"abhishek\"><a href=\"#abhishek\" class=\"phenomic-HeadingAnchor\">#</a>Abhishek</h3>\n<p>Abhishek is our COO. His primary responsibilities include figuring out our\nmarketing strategy, investigating potential funding opportunities, and writing\nsome of the Node.js code for the our REST endpoints.</p>\n<div class=\"spacer\" />\n","__filename":"work/hyperionai-old.md","__url":"/work/hyperionai-old/","__resourceUrl":"/work/hyperionai-old/index.html","__dataUrl":"/work/hyperionai-old/index.html.42fb2d11731c977cbb3e75ced3bc7b44.json"}