{"head":{"title":"Transportr","subtitle":"Tech Demo","date":"2017-07","layout":"Post","size":"large","image":"transportr.gif","description":"TRANSPORTR Background TRANSPORTR is a tech demo I created for me to gain exposure to some (semi) emerging technologies that I have always…"},"body":"<h1 id=\"transportr\"><a href=\"#transportr\" class=\"phenomic-HeadingAnchor\">#</a>TRANSPORTR</h1>\n<iframe src=\"https://player.vimeo.com/video/224407553?color=ffffff&title=0&byline=0&portrait=0\" width=\"800\" height=\"500\" frameborder=\"0\" webkitallowfullscreen=\"true\" mozallowfullscreen=\"true\" allowfullscreen=\"true\"></iframe>\n<h2 id=\"background\"><a href=\"#background\" class=\"phenomic-HeadingAnchor\">#</a>Background</h2>\n<p>TRANSPORTR is a tech demo I created for me to gain exposure to some (semi) emerging technologies\nthat I have always been interested in. As I started to wrap up and shutter the startup I created,\nI figured I'd take about a week off to build something fun.</p>\n<div class=\"spacer\" />\n<h2 id=\"overview\"><a href=\"#overview\" class=\"phenomic-HeadingAnchor\">#</a>Overview</h2>\n<p>The primary purpose for this project is to allow users to transfer files to each other directly. By\nhaving the files sent peer to peer, the project is able to run with a tiny fraction of the bandwith\n(and potentialy storage costs) that a normal file transfer service would require.</p>\n<p>When a user uploads a file to the site, the browser uses the <a href=\"https://www.w3.org/TR/WebCryptoAPI/\">Web Cryptography API</a>\nto generate a private key which is sent to the server. The client then spins up a web worker process\nto encrypt the file using the key before creating a webtorrent hash.</p>\n<p>The hash is then used as the parameter for the URL which the user can share with others. When someone\nelse clicks on the link, the encrypted file will begin to download. The TRANSPORTR server will also\ndispense the decryption key. Once the file is finished downloading, it will automaticallly become\ndecrypted and available for download.</p>\n<p>Additionally, users are able to request payment for their files. In this case, the key is not\nprovided by the server until it verifies that a successful payment was made.</p>\n<div class=\"spacer\" />\n<h2 id=\"try-it-outmore-information\"><a href=\"#try-it-outmore-information\" class=\"phenomic-HeadingAnchor\">#</a>Try it out/More information</h2>\n<p>Please note that this is very much a very early work in progress and there may be bugs. Please do not\nuse it for anything important!</p>\n<p>More information is available on the <a href=\"https://transportr.services\">about</a> page of the site. If you\nwant to try it out, you can go straight to <a href=\"https://transportr.services/upload\">https://transportr.services/upload</a></p>\n","__filename":"work/transportr.md","__url":"/work/transportr/","__resourceUrl":"/work/transportr/index.html","__dataUrl":"/work/transportr/index.html.43b0b6ade0ca9bf8239f51caa08f92a3.json"}